In [55]:
#standard libraries
import pandas as pd, numpy as np

#parsing
import requests
from bs4 import BeautifulSoup

#randomization
from faker import Faker

### **export table from website**

EXTRACT MOST POPULAR MALE / FEMALE NAMES

In [56]:
#state the link
url = 'https://www.ssa.gov/oact/babynames/decades/century.html'

#check the response
page = requests.get(url)
page

In [57]:
#look at first 500 characters of the response
print(page.text[0:500])

<!DOCTYPE html>
<html class="no-js" lang="en">

<head>
  <!-- REQUIRED META INFORMATION -->
  <meta charset="UTF-8" />
  <meta http-equiv="X-UA-Compatible" content="IE=edge" />
  <meta name="viewport" content="width=device-width, initial-scale=1" />
  <meta name="msapplication-tap-highlight" content="no" />
  <!-- PAGE TITLE -->
  <title>Top Names Over the Last 100 Years</title>
  <!-- PAGE META INFORMATION -->
  <meta name="DCTERMS:coderOffice" content="OCACT" />
  <meta name="DCTE

In [58]:
#use HTML
soup = BeautifulSoup(page.content, 'html.parser')

In [59]:
#use table tag to extract the list
table = soup.find('table')
table_rows = table.find_all('tr')
names = []
for tr in table_rows:
    td = tr.find_all('td')
    row = [i.text for i in td]
    names.append(row)

In [60]:
#create a dataframe from the exported table
first_names = pd.DataFrame(names)

display(first_names.head(3))
display(first_names.tail(3))

      0      1          2     3          4
0         None       None  None       None
1  None   None       None  None       None
2     1  James  4,586,625  Mary  2,985,148

,0,1,2,3,4
100,99,Russell,"309,102",Lori,"337,994"
101,100,Lucas,"308,351",Tiffany,"337,966"
102,,\r\n Source: 100% sample based on Social Sec...,None,None,None

In [61]:
#remove the first two rows
first_names = first_names.drop([0, 1, 102],
                               axis=0)

display(first_names.head(3))
display(first_names.tail(3))

   0        1          2         3          4
2  1    James  4,586,625      Mary  2,985,148
3  2  Michael  4,350,425  Patricia  1,546,373
4  3   Robert  4,305,346  Jennifer  1,470,260

       0        1        2        3        4
99    98  Bradley  310,194    Doris  341,604
100   99  Russell  309,102     Lori  337,994
101  100    Lucas  308,351  Tiffany  337,966

In [62]:
#rename the columns
first_names = first_names.rename(columns={0: 'Rank',
                                          1: 'Male_Name',
                                          2: 'Frequency',
                                          3: 'Female_Name',
                                          4: 'Frequency',
})

In [63]:
first_names = first_names.reset_index()
first_names.head(3)

   index Rank Male_Name  Frequency Female_Name  Frequency
0      2    1     James  4,586,625        Mary  2,985,148
1      3    2   Michael  4,350,425    Patricia  1,546,373
2      4    3    Robert  4,305,346    Jennifer  1,470,260

In [64]:
first_names.shape

(100, 6)

In [65]:
#extract only male names
male_name = first_names.iloc[:, 2:3]
male_name.head(2)

  Male_Name
0     James
1   Michael

In [66]:
male_name.shape

(100, 1)

In [67]:
#extract only female names
female_name = first_names.iloc[:, 4:5]
female_name.head(2)

  Female_Name
0        Mary
1    Patricia

In [68]:
female_name.shape

(100, 1)

EXTRACT MOST POPULAR SURNAMES

In [69]:
#state the link
url = 'https://names.mongabay.com/most_common_surnames.htm'

#check the response
page = requests.get(url)
page

In [70]:
#look at first 500 characters of the response
print(page.text[0:500])

<!doctype html>
<html amp lang="en">
  <head>
    <meta charset="utf-8">


<title>Most Common Surnames [Last Names] in the United States (top 1000)</title>
<link rel="canonical" href="https://names.mongabay.com/most_common_surnames.htm">
<meta property="og:title" content="Most Common Surnames [Last Names] in the United States (top 1000)">
<meta property="og:type" content="article">
<meta property="og:url" content="https://names.mongabay.com/most_common_surnames.htm">
<meta property="og:image" co

In [71]:
#get HTML
soup = BeautifulSoup(page.content, 'html.parser')

In [72]:
#use table tag to extract the list
table = soup.find('table')
table_rows = table.find_all('tr')
last_names = []
for tr in table_rows:
    td = tr.find_all('td')
    row = [i.text for i in td]
    last_names.append(row)

In [73]:
#create a dataframe from the exported table
surnames = pd.DataFrame(last_names)

display(surnames.head(3))
display(surnames.tail(3))

         0            1      2     3
0     None         None   None  None
1    SMITH   2,501,922   1.006     1
2  JOHNSON   2,014,470    0.81     2

            0         1      2     3
998   WHITLEY   29,844   0.012   998
999      NOEL   29,844   0.012   999
1000     VANG   29,844   0.012  1000

In [74]:
#remove the first row
surnames = surnames.drop([0],
                         axis=0)

surnames.head(3)

          0            1      2  3
1     SMITH   2,501,922   1.006  1
2   JOHNSON   2,014,470    0.81  2
3  WILLIAMS   1,738,413   0.699  3

In [75]:
#rename the columns
surnames = surnames.rename(columns={0: 'Surname',
                                    1: 'Frequency',
                                    2: 'Percentage',
                                    3: 'Rank',
})

In [76]:
surnames.head(3)

    Surname    Frequency Percentage Rank
1     SMITH   2,501,922       1.006    1
2   JOHNSON   2,014,470        0.81    2
3  WILLIAMS   1,738,413       0.699    3

In [77]:
#extract only 200 records
last_name = surnames.iloc[:200, :1]
last_name.head(3)

    Surname
1     SMITH
2   JOHNSON
3  WILLIAMS

In [78]:
last_name.shape

(200, 1)

EXTRACT CITIES

In [79]:
city = pd.read_excel('./experimental/tables_to_use/city.xlsx')
city.head()

               CITY
0            Moscow
1  Saint-Petersburg
2       Novosibirsk
3     Yekaterinburg
4             Kazan

In [80]:
#extract only 200 records
city = city.iloc[:200, :1]

In [81]:
city.shape

(200, 1)

#### CREATE THE STUDENTS TABLE

In [82]:
#initialize lists
lst = {'First_Name': (male_name.iloc[:, 0].values.tolist() + female_name.iloc[:, 0].values.tolist()),
       'Last_Name': last_name.iloc[:, 0].values,
       'city_old': city.iloc[:, 0].values}

#create the dataframe
students = pd.DataFrame(lst)

In [83]:
#display
students.head(3)

  First_Name Last_Name          city_old
0      James     SMITH            Moscow
1    Michael   JOHNSON  Saint-Petersburg
2     Robert  WILLIAMS       Novosibirsk

In [84]:
#convert from all capitals to starting capital letter only
students['Last_Name'] = students['Last_Name'].apply(lambda x: x.capitalize())

FIND TOP CITIES

In [85]:
#state the link
url = 'https://en.wikipedia.org/wiki/List_of_cities_and_towns_in_Russia_by_population'

#check the response
page = requests.get(url)
page

In [86]:
#use HTML
soup = BeautifulSoup(page.content, 'html.parser')

In [87]:
#use table tag to extract the list
table = soup.find('table')
table_rows = table.find_all('tr')
top_cities = []
for tr in table_rows:
    td = tr.find_all('td')
    row = [i.text for i in td]
    top_cities.append(row)

In [88]:
#create a dataframe from the exported table
top_city = pd.DataFrame(top_cities)

#remove the first row
top_city = top_city.drop([0],
                         axis=0)

In [89]:
top_city.iloc[:16, 0]

1               Moscow\n
2     Saint Petersburg\n
3          Novosibirsk\n
4        Yekaterinburg\n
5                Kazan\n
6      Nizhny Novgorod\n
7          Chelyabinsk\n
8          Krasnoyarsk\n
9               Samara\n
10                 Ufa\n
11       Rostov-on-Don\n
12                Omsk\n
13           Krasnodar\n
14            Voronezh\n
15                Perm\n
16           Volgograd\n
Name: 0, dtype: object

In [90]:
#find 1st character of the first name
students['1st'] = students['First_Name'].apply(lambda x: x[0])

SET CITY BY CONDITION

In [91]:
#create a function to change to top city
def change_city(data):
    if data['1st'] == 'J':
        return 'Moscow'
    elif data['1st'] == 'A':
        return 'Saint-Petersburg'
    elif data['1st'] == 'D':
        return 'Novosibirsk'
    elif data['1st'] == 'B':
        return 'Yekaterinburg'
    elif data['1st'] == 'C':
        return 'Kazan'
    elif data['1st'] == 'M':
        return 'Nizhniy Novgorod'
    elif data['1st'] == 'L':
        return 'Chelyabinsk'
    elif data['1st'] == 'K':
        return 'Omsk'
    elif data['1st'] == 'S':
        return 'Samara'
    elif data['1st'] == 'R':
        return 'Rostov'
    elif (data['1st'] == 'T' or data['1st'] == 'G'):
        return 'Krasnoyarsk'
    elif data['1st'] == 'E':
        return 'Ufa'
    elif (data['1st'] == 'H' or data['1st'] == 'P'):
        return 'Voronezh'
    elif data['1st'] == 'N':
        return 'Volgograd'
    else:
        return data['city_old']

In [92]:
#apply the function
students['City'] = students.apply(change_city,
                                      axis=1)

In [93]:
#remove uninformative features
students = students.drop(['city_old', '1st'],
                         axis=1)

CREATE BIRTH_DATE

In [94]:
#set currently uninformative feature to None
students['Birth_Date'] = None

In [95]:
#create the object class
fake = Faker()

#set the entry limit
entry_number = 200

#set iteration number
i = 0

#create an empty list
birth_dates = []

#create a random list of dates
while i < entry_number:
    birth_dates.append(fake.date_of_birth(minimum_age=18, maximum_age=65))
    i += 1

In [96]:
#create the new feature
students = students.assign(Birth_Date=birth_dates)

In [97]:
#convert to datetime
students['Birth_Date'] = pd.to_datetime(students['Birth_Date'])

CREATE E-MAILS

In [98]:
#create an empty table
emails = []

#merge two features together
for e in (students['First_Name'].values + students['Last_Name'].values):
    #set to lower case
    email = e.lower() + '@yandex.com'
    #add the element to the table
    emails.append(email)

In [99]:
#insert the new feature
students.insert(4, 'E-Mail', emails, True)

In [100]:
#reset the index to create the index
students = students.reset_index()

In [101]:
#rename the column
students = students.rename(columns={'index': 'Student_ID',
                                    })

CREATE STUDENT_ID

In [102]:
#write a function to create the student ID
def create_student_id(data):
    if len(str(data['Student_ID'])) == 1:
        return 'S00000' + str(data['Student_ID'])
    elif len(str(data['Student_ID'])) == 2:
        return 'S0000' + str(data['Student_ID'])
    elif len(str(data['Student_ID'])) == 3:
        return 'S000' + str(data['Student_ID'])
    else:
        return 0

In [103]:
#apply the function
students['Student_ID'] = students.apply(create_student_id,
                                        axis=1)

CHECK FOR NULL VALUES

In [104]:
#check for null values
students.isnull().sum()[students.isnull().sum() > 0]

Series([], dtype: int64)

RENAME FEATURES

In [105]:
#rename the feature(s)
students = students.rename(columns={'Student_ID': 'STUDENT_ID',
                                    'First_Name': 'FIRST_NAME',
                                    'Last_Name': 'LAST_NAME',
                                    'City': 'CITY',
                                    'Birth_Date': 'BIRTH_DATE',
                                    'E-Mail': 'E-MAIL',
                                    'Phone_Number': 'PHONE_NUMBER',
                              })

In [106]:
#check that the changes were applied correctly
students.head(3)

,STUDENT_ID,FIRST_NAME,LAST_NAME,CITY,BIRTH_DATE,E-MAIL
0,S000000,James,Smith,Moscow,1974-08-25,jamessmith@yandex.com
1,S000001,Michael,Johnson,Nizhniy Novgorod,1970-02-13,michaeljohnson@yandex.com
2,S000002,Robert,Williams,Rostov,1974-09-03,robertwilliams@yandex.com

EXPORT THE TABLE

In [107]:
#create a file name
xlx_name = 'students.xlsx'

#export to excel
students.to_excel('./experimental/created_tables/' + xlx_name,
                  sheet_name='student_details')